const pluginConfig = {
    name: 'تحفيل',
    alias: ['هجوم'],
    category: 'owner',
    description: '🔞 أمر خاص للمطور',
    usage: '.تحفيل @شخص',
    example: '.تحفيل @شخص',
    isOwner: true,
    isPremium: false,
    isGroup: true,
    isPrivate: false,
    cooldown: 60,
    energi: 0,
    isEnabled: true
};

async function handler(m, { sock }) {
    let target = null;

    if (m.quoted) {
        target = m.quoted.sender;
    } else if (m.mentionedJid && m.mentionedJid.length > 0) {
        target = m.mentionedJid[0];
    } else if (m.args.length > 0) {
        const num = m.args[0].replace(/[@!]/g, '');
        if (num.length > 5) target = `${num}@s.whatsapp.net`;
    }

    if (!target) return m.reply(`❌ *يرجى منشن الشخص أو الرد على رسالته!*`);

    const targetName = target.split('@')[0];

    await m.react("🔞");

    const messages = [
        `@${targetName} امك مايا خليفه و خالتك ساره جاي* 😸😂`,
        `*خ ــوﯝﯠلإآأڼـ ــجﭳ ـيي 🌹😸*~*ڪڮــــــ໑ـﯛ҄͢͠سِ҄͢͠ـــــــــوَـم\`ـــــڪـــًــڰًََِ🍒*~ @${targetName}`,
        `𝑀ARO 💕🔥 ᥬ🥺᭄ يــضـ͜⏣ح͡⃢ـڪ͡ـ هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢هہﮩ⃢ @${targetName}`,
        `@${targetName} خخخخخخ  امك صاحبتي واختك اللبوه بترقص على مطوتي يلا يا اللي امك بتتص  وبتحب المص😘✄ᥬ`,
        `ٱفــشـــــخـــــت جـــــبـــــهـــــتـــــگگ بنفسگگ عشان حـــــگگـــــتـــــهـــــا معايا.....)😹😹🔥 @${targetName}`,
        `@${targetName} اصـحــي يــا الــي امـٚګ صـاحـبـتـي😹🌝`,
        `اوعي تحك في زوبري اڜᷱــهرڪ͡ـ 🤭الختم بتاعي بقا @${targetName}`,
        `ڪ͡ـسᷱــم͜ڪ͡ـ لاجل 🤡╭☞ ☁✨爱 ℱℜ❸❍ղ爱✨☁🔥 ڜᷱــخ͜⃢ـص͜ـ♪ـيــاشششششش هـتـح ـك ولا اية يــاآإ ڪٌـســمم ـڪك 😏 @${targetName}`,
        `@${targetName} صباح الـخ ـيرر علشان هنحط فــۍ طٌيزك فطيُر 😘ٱفــشـــــخـــــت جـــــبـــــهـــــتـــــگگ بنفسگگ عشان حـــــگگـــــتـــــهـــــا معايا.....)😹😹🔥`,
        `اصـحــي يــا الــي امـٚګ صـاحـبـتـي😹🌝 @${targetName}`,
        `@${targetName} اوعي تحك في زوبري اڜᷱــهرڪ͡ـ 🤭يسطا انا اصغر واحد من عيالي يسحب عيلة يــا ڪ͡ـسᷱــم͜ڪ͡ـلو໑ ډڪ͡ـࢪ͜ تـོ✘ـع͓  حك في ̸ـزبي 👹`,
        `*هفـــــشخگگ بضـــــمـــــير بس ههټحتاج عـــــصـــــيـــــر.../😹😒*🔥 @${targetName}`,
        `@${targetName} *تعالا مصمص في زبي شويه* 😸😶`,
        `تـعـ؏ اتـبـنـاڪک واخـلـيـڪک تـبـطـل تـتـنـاڪک ﮪ ـــههههههههههـهههههههههههههههههههههـہ😈 كسم طيزك Tarboo Bot ێضح ـڪ 😹😹🥱 @${targetName}`,
        `@${targetName} ڪسسمڪ لآجــل ﴿maro🦧🌑`,
        `يآبن آلفآجــره يآلي آخــتڪ بتتنآڪ ببلآش آلآ ربع متنسسآش آني شربتهآ من لبن آلمرآعــيؤآمڪ مڪنتش بتقؤم من عــلي بتآعــي🍌🍌🍌🍯 @${targetName}`,
        `@${targetName} ڪڪـ ـؤؤســم ـمـڪڪك لاآجج ـل انك خول😛`,
        `صباح الخیر یکسمك🫥 @${targetName}`,
        `@${targetName} بكس ختك بكسسسسسسسسسسسسسسسخخخخخخختتتتتكككككككك يا  سسسسدددددححححححح رررررددددددحححححح`,
        `كسمك يبن الزواني يدمج 😂😂 @${targetName}`,
        `@${targetName} امك مايا خليفا وابوك ساره جاي وابوك فاتح امك بخياره وامك جيباك من علي موقع سكس يبن الزواني 😂😂😂😂🦶😍💋`,
        `꧁كــســمـڴ وكــســـم ابـوكڪ وكـسـم ـم ايي حـد فـي عـيـلـتـڪ🖤꧂يــا ډيــن̯ـ☤ـ ام͜ي ډة ب͡ـ↫ـق͜ـ♥ـا م͜⃢ج͜ا.ل هہﮩ⃢ب͡ـ↫ـيــډة ڪ͡ـسᷱــم͜ الم͜⃢ج͜ال ع͓ڜᷱــان̯ـ☤ـڪ͡ـ يــخ͜⃢ـو໑ل ،👻😂َِ✌️!َ''))قولتلك مش هتعرفف تسد مع ـايا 😎 @${targetName}`,
        `@${targetName} ꧁كــســمـڴ وكــســـم ابـوكڪ وكـسـم ـم ايي حـد فـي عـيـلـتـڪ🖤꧂قولتلك مش هتعرفف تسد مع ـايا 😎`,
        `꧁كــســمـڴ وكــســـم ابـوكڪ وكـسـم ـم ايي حـد فـي عـيـلـتـڪ🖤꧂ 🔞[Maro]للتربيه والتعليم🔞🔚 @${targetName}`,
        `@${targetName} ناك امك تلاته صعايده واحد نط واحد حط واحد قلعها الكلوتاختك. فردتي لبوتي جيت انيكها قالتلي يا هايج استنا حته اقلع`,
        `كسمك يا بن باكو ابوك القرد ناكه امك من كتر غيظها شدت فشعر طيزهاامك شرموطه قرموطه علي زوبري مربوطه @${targetName}`,
        `@${targetName} قالوا لامك الشرموطه توبي قالت مين هيملي جيوبي قالوا لاختك اللبوه اتلمي قالت مين هيشيل همي كسمك لاجل ميكي ناك امك واحد بلجيكي`,
        `هسحب سحبه وانيك امك القحبه هسحب سحبتين وانيك امك مرتين هسحب تلت سحبات وانيك امك بثبات هسحب الرابعه وانيك امك في الضبعه هسحب التن لبني فطيزك هيرن يابن كوم زنا الزواني ياللي امك مني بتعاني @${targetName}`,
        `@${targetName} امك اسمها تيسير وبتتناك كتير دخلنا فـ الجد وكسمك مالوش حد كسمك يا جاهل كسمك مبقاش يستاهل اختك جات تلبس بضاني طلع كسها برتقانى كسمك سكر بره هات اختك بالمره كسمك عويل كسمك بيطير`,
        `امك اسمها رحاب بتتناك ورا الباب من كل الاحباب ابوك خول بـ لبانه وامك شرموطه تعبانه🫥🫦 @${targetName}`,
        `@${targetName} بععععع امك صحبتي 🫥🦧𝕸𝕬𝕽𝕺`
    ];

    for (const text of messages) {
        try {
            await sock.sendMessage(m.chat, { text, mentions: [target] });
            await new Promise(resolve => setTimeout(resolve, 2000));
        } catch (err) {
            await new Promise(resolve => setTimeout(resolve, 5000));
        }
    }
}

export { pluginConfig as config, handler };